INSERT INTO ris_projekat.Course (naziv,opis,sadrzaj,idProfesor,sifra) VALUES
	 ('Razvoj informacionih sistema','Оспособљавање студента за развој информационих система са трослојном софтверском архитектуром. ','Архитектуре вишеслојних клијент/сервер система. Основе сервлетске технологије. Праћење сесије. Основни
концепти JSP технологије. JSP стандардна библиотека тагова и JSP expression language. Преглед савремених
фрејмворка за развој Веб апликација. Аутоматизација компајлирања и паковање извршне верзије Веб
апикације. Извештавање у информационим системима.',2,'$2a$10$tH8o3K1bceUvRzLk0r.xVecAE1qUJTTBU2R.uxAy9RUsrUAZyze56'),
	 ('Baze podataka','Оспособљавање студената за пројектовање, креирање и коришћење (SQL упити) релационог
модела базе података, као и за савладавање принципа функционисања СУБП-а','Базе података и њихова улога у развоју информационих система. Основни појмови и концепција базе
података. Систем за управљање базом података. Модели података. ER модел података. Релациони модел
података. Превођење ЕР у релациони модел података. SQL као језик за манипулисање подацима.
Трансакциона обрада података.',3,'$2a$10$tH8o3K1bceUvRzLk0r.xVecAE1qUJTTBU2R.uxAy9RUsrUAZyze56'),
	 ('Veštačka inteligencija','Упознавање студената са основним принципима вештачке интелигенције (ВИ) и оспособљавање за
имплементацију софтверских апликација са елементима представљањa знања, претраживањa и закључивањa.','Историја ВИ. Интелигентни агенти. Решавање проблема претраживањем: стратегије за слепо претраживање
и стратегије за информисано (хеуристичко) претраживање. Претраживање простора стања у играма:
Минимакс алгоритам. Пример имплементације Минимакс алгоритма у игри са два играча. Представљање
знања и закључивање у логици првог реда. Онтолошки инжењеринг и семантичке мреже. Представљање
несигурности у системима вештачке интелигенције. Одлучивање у системима вештачке интелигенције.
Основе машинског учења. Основни принципи обраде природног језика.',3,'$2a$10$tH8o3K1bceUvRzLk0r.xVecAE1qUJTTBU2R.uxAy9RUsrUAZyze56'),
	 ('Strukture podataka i algoritmi','Предмет треба да омогући студентима да разумеју и користе динамичке структуре података. ','Основни концепти програмских језика потреби за ефикасно програмирање структуре података и алгоритама.
Дефиниције апстрактних структуре података. Различити критеријуми за имплементацију структура
података. Ефикасност алгоритамам и њихова комплексност. Апстрактна струткура подаката ЛИСТА.
Имплементације листи и основних операција са листама. Кружне листе, коришћење граничника и заглавља.
Вишеструко повезане листе. Апстрактни типови података стек и ред опслуживања. Различите
имплментације стека и реда опслуживања.',4,'$2a$10$tH8o3K1bceUvRzLk0r.xVecAE1qUJTTBU2R.uxAy9RUsrUAZyze56');